container-sec/logs/artillery-phases.log
Phase started: K8s - Warm Up (index: 0, duration: 10s) 08:30:24(+0000)

Phase completed: K8s - Warm Up (index: 0, duration: 10s) 08:30:34(+0000)

Phase started: K8s - Stretch (index: 1, duration: 20s) 08:30:34(+0000)

Phase completed: K8s - Stretch (index: 1, duration: 20s) 08:30:54(+0000)

Phase started: K8s - Escalate (index: 2, duration: 20s) 08:30:54(+0000)

--------------------------------------
Metrics for period to: 08:30:30(+0000) (width: 4.747s)
--------------------------------------

http.codes.403: ................................................................ 24160
http.downloaded_bytes: ......................................................... 4469600
http.request_rate: ............................................................. 7137/sec
http.requests: ................................................................. 24169
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 13
  mean: ........................................................................ 0.4
  median: ...................................................................... 0
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 24160
vusers.created: ................................................................ 9
vusers.created_by_name.0: ...................................................... 9


--------------------------------------
Metrics for period to: 08:30:40(+0000) (width: 9.999s)
--------------------------------------

http.codes.403: ................................................................ 107464
http.downloaded_bytes: ......................................................... 19880840
http.request_rate: ............................................................. 12760/sec
http.requests: ................................................................. 107510
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 81
  mean: ........................................................................ 1.4
  median: ...................................................................... 1
  p95: ......................................................................... 4
  p99: ......................................................................... 7
http.responses: ................................................................ 107464
vusers.created: ................................................................ 49
vusers.created_by_name.0: ...................................................... 49


Phase completed: K8s - Escalate (index: 2, duration: 20s) 08:31:14(+0000)

--------------------------------------
Metrics for period to: 08:30:50(+0000) (width: 9.999s)
--------------------------------------

http.codes.403: ................................................................ 122073
http.downloaded_bytes: ......................................................... 22583320
http.request_rate: ............................................................. 13219/sec
http.requests: ................................................................. 122145
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 166
  mean: ........................................................................ 3.7
  median: ...................................................................... 3
  p95: ......................................................................... 10.1
  p99: ......................................................................... 16
http.responses: ................................................................ 122073
vusers.created: ................................................................ 75
vusers.created_by_name.0: ...................................................... 75


--------------------------------------
Metrics for period to: 08:31:00(+0000) (width: 9.999s)
--------------------------------------

http.codes.403: ................................................................ 103451
http.downloaded_bytes: ......................................................... 19138620
http.request_rate: ............................................................. 11357/sec
http.requests: ................................................................. 103553
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 162
  mean: ........................................................................ 8.6
  median: ...................................................................... 6
  p95: ......................................................................... 24.8
  p99: ......................................................................... 40
http.responses: ................................................................ 103451
vusers.created: ................................................................ 103
vusers.created_by_name.0: ...................................................... 103


--------------------------------------
Metrics for period to: 08:31:10(+0000) (width: 9.999s)
--------------------------------------

http.codes.403: ................................................................ 94506
http.downloaded_bytes: ......................................................... 17483610
http.request_rate: ............................................................. 9919/sec
http.requests: ................................................................. 94660
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 162
  mean: ........................................................................ 15.7
  median: ...................................................................... 10.9
  p95: ......................................................................... 46.1
  p99: ......................................................................... 68.7
http.responses: ................................................................ 94506
vusers.created: ................................................................ 150
vusers.created_by_name.0: ...................................................... 150


--------------------------------------
Metrics for period to: 08:31:20(+0000) (width: 9.999s)
--------------------------------------

http.codes.403: ................................................................ 96993
http.downloaded_bytes: ......................................................... 17943705
http.request_rate: ............................................................. 9710/sec
http.requests: ................................................................. 97085
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 236
  mean: ........................................................................ 23.1
  median: ...................................................................... 16.9
  p95: ......................................................................... 63.4
  p99: ......................................................................... 94.6
http.responses: ................................................................ 96993
vusers.created: ................................................................ 94
vusers.created_by_name.0: ...................................................... 94


--------------------------------------
Metrics for period to: 08:31:30(+0000) (width: 9.999s)
--------------------------------------

http.codes.403: ................................................................ 105462
http.downloaded_bytes: ......................................................... 19510470
http.request_rate: ............................................................. 10548/sec
http.requests: ................................................................. 105460
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 223
  mean: ........................................................................ 22.8
  median: ...................................................................... 16
  p95: ......................................................................... 63.4
  p99: ......................................................................... 87.4
http.responses: ................................................................ 105462


--------------------------------------
Metrics for period to: 08:31:40(+0000) (width: 9.999s)
--------------------------------------

http.codes.403: ................................................................ 107428
http.downloaded_bytes: ......................................................... 19874180
http.request_rate: ............................................................. 10748/sec
http.requests: ................................................................. 107428
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 188
  mean: ........................................................................ 22.2
  median: ...................................................................... 16
  p95: ......................................................................... 62.2
  p99: ......................................................................... 83.9
http.responses: ................................................................ 107428